import React from 'react'
import { Container, Row, Col } from "react-bootstrap";
function Condations() {
 const conditions = [
   { text: "الحاصلين على درجة البكالوريوس أو شهادة تعاقد من جامعة معتمدة." },
   { text: "الحاصلين على نتيجة عليا في البكالوريوس (معدل جيد أو أفضل)." },
   {
     text: "الحاصلين على شهادة في اللغة الانجليزية (الأمر المطلوب في بعض البرامج).",
   },
   {
     text: "الحاصلين على شهادة في برنامج القيادة السياحية (الأمر المطلوب في بعض البرامج).",
   },
   {
     text: "الحاصلين على شهادة في برنامج الأمن الوطني (الأمر المطلوب في بعض البرامج).",
   },
   { text: "الحاصلين على شهادة في برنامج القيادة الناقلات الكهربائية." },
   { text: "الحاصلين على شهادة في برنامج التقنية المدنية." },
   { text: "الحاصلين على شهادة في برنامج الترجمة." },
   { text: "الحاصلين على شهادة في برنامج المعلومات الأمنية." },
   { text: "الحاصلين على شهادة في برنامج التنمية البشرية." },
   { text: "الحاصلين على شهادة في برنامج التربية الرياضية." },
   { text: "الحاصلين على شهادة في برنامج التربية الحاسبية." },
 ];

 return (
   <div className='conditions'>
     <Container>
       <h1 className='main-header'>الشروط المطلوبة للالتحاق بالدراسات العليا - جامعة المنيا</h1>
       <Row>
         <Col>
           <ul>
             {conditions.map((condition, index) => (
               <li key={index}>{condition.text}</li>
             ))}
           </ul>
         </Col>
       </Row>
     </Container>
   </div>
 );
}

export default Condations
